In [1]:
import numpy as np
import pandas as pd

In [2]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [3]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(0)

In [6]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [7]:
df # in the output there are two levels g1,g2 and 3 inside levels and this is multi indexing

             A         B
G1 1  1.764052  0.400157
   2  0.978738  2.240893
   3  1.867558 -0.977278
G2 1  0.950088 -0.151357
   2 -0.103219  0.410599
   3  0.144044  1.454274

In [8]:
df.loc['G1'].loc[1]

A    1.764052
B    0.400157
Name: 1, dtype: float64

In [9]:
df.index.names=['Groups','Names']

In [10]:
df

                     A         B
Groups Names
G1     1      1.764052  0.400157
       2      0.978738  2.240893
       3      1.867558 -0.977278
G2     1      0.950088 -0.151357
       2     -0.103219  0.410599
       3      0.144044  1.454274

In [11]:
df.loc['G2'].loc[2]['B']

0.41059850193837233

In [12]:
df.xs('G1')

              A         B
Names
1      1.764052  0.400157
2      0.978738  2.240893
3      1.867558 -0.977278

In [13]:
df.xs(1,level='Names')# xs can directly go into inner indices by defining the level

               A         B
Groups
G1      1.764052  0.400157
G2      0.950088 -0.151357

In [16]:
df

                     A         B
Groups Names
G1     1      1.764052  0.400157
       2      0.978738  2.240893
       3      1.867558 -0.977278
G2     1      0.950088 -0.151357
       2     -0.103219  0.410599
       3      0.144044  1.454274

In [18]:
df.xs(3,level='Names')

               A         B
Groups
G1      1.867558 -0.977278
G2      0.144044  1.454274

In [6]:
def times_2(var):
    return var**2

In [7]:
times_2(8)

64

In [34]:
seq=[1,2,3,4]
map(times_2,seq)

In [5]:
list(map(times_2,seq))

[1, 4, 9, 16]

In [9]:
t=lambda var: var*2

In [11]:
t(6)

12

In [12]:
list(map(lambda x: x*2,seq))

[2, 4, 6, 8]

In [14]:
list(map(lambda x: x%2==0,seq))

[False, True, False, True]

In [15]:
list(filter(lambda x: x%2==0,seq))

[2, 4]

In [16]:
s='hello my dear kutti'

In [17]:
s.split()

['hello', 'my', 'dear', 'kutti']

In [18]:
t='hello my # dear kutti'

In [20]:
t.split('#')[1]

' dear kutti'

In [21]:
lst=[2,3,4,56,3,1]

In [22]:
lst.pop()

1

In [23]:
lst.pop(2)

4

In [24]:
lst.append('new')

In [25]:
lst

[2, 3, 56, 3, 'new']

In [26]:
'x'in ['x','y','z']

True

In [28]:
x=[(1,2),(3,4),(5,6)]
x

[(1, 2), (3, 4), (5, 6)]

In [29]:
x[0]

(1, 2)

In [30]:
 x[0][0]

1

In [32]:
#tuple unpacking
for (a,b)in x:
    print (a)

1
3
5

In [10]:
df=pd.read_csv('airbnb prices.csv',nrows=2,usecols=['room_id','country','city'],dtype={'room_id':int,'city':str})

In [11]:
df['country']='Holland'

In [13]:
df['room_id'].dtype

dtype('int32')

In [14]:
df

    room_id  country       city
0  10176931  Holland  Amsterdam
1   8935871  Holland  Amsterdam

In [15]:
df=pd.read_csv('airbnb prices.csv')

In [17]:
df.columns.to_list

<bound method IndexOpsMixin.tolist of Index(['room_id', 'survey_id', 'host_id', 'room_type', 'country', 'city',
       'borough', 'neighborhood', 'reviews', 'overall_satisfaction',
       'accommodates', 'bedrooms', 'bathrooms', 'price', 'minstay', 'name',
       'last_modified', 'latitude', 'longitude', 'location'],
      dtype='object')>

In [21]:
df.dtypes.value_counts()

float64    9
object     6
int64      5
dtype: int64

In [19]:
df.select_dtypes(include=['int64'])

        room_id  survey_id    host_id  reviews  accommodates
0      10176931       1476   49180562        7             2
1       8935871       1476   46718394       45             4
2      14011697       1476   10346595        1             3
3       6137978       1476    8685430        7             4
4      18630616       1476   70191803        1             2
...         ...        ...        ...      ...           ...
18718  17789893       1476   47501089       10             3
18719  16877166       1476   67093870        6             4
18720  19859427       1476   29724632        0             1
18721  17132164       1476  115156569       13             2
18722   7605782       1476   39503013      113             2

[18723 rows x 5 columns]

In [29]:
df['reviews'].value_counts(dropna=True)

     index  reviews
0        0     2984
1        1     1510
2        2     1246
3        3     1103
4        4      925
..     ...      ...
221    447        1
244    452        1
283    463        1
263    465        1
245    532        1

[284 rows x 2 columns]

In [30]:
df1 = pd.DataFrame({ 'id': [1,2,3], 'c1':[0,0,np.nan], 'c2':
[np.nan,1,1]})

In [31]:
df1

   id   c1   c2
0   1  0.0  NaN
1   2  0.0  1.0
2   3  NaN  1.0

In [43]:
 df1[['c1', 'c2']].isnull().sum(axis=1)

0    1
1    0
2    1
dtype: int64

In [44]:
import numpy as np

In [49]:
print(df[:5].to_csv(float_format='%.0f'))

,room_id,survey_id,host_id,room_type,country,city,borough,neighborhood,reviews,overall_satisfaction,accommodates,bedrooms,bathrooms,price,minstay,name,last_modified,latitude,longitude,location
0,10176931,1476,49180562,Shared room,,Amsterdam,,De Pijp / Rivierenbuurt,7,4,2,1,,156,,Red Light/ Canal view apartment (Shared),2017-07-23 13:06:27.391699,52,5,0101000020E610000033FAD170CA8C13403BC5AA41982D4A40
1,8935871,1476,46718394,Shared room,,Amsterdam,,Centrum West,45,4,4,1,,126,,Sunny and Cozy Living room in quite neighbours,2017-07-23 13:06:23.607187,52,5,0101000020E6100000842A357BA095134042791F4773304A40
2,14011697,1476,10346595,Shared room,,Amsterdam,,Watergraafsmeer,1,0,3,1,,132,,Amsterdam,2017-07-23 13:06:23.603546,52,5,0101000020E6100000A51133FB3CC613403543AA285E2B4A40
3,6137978,1476,8685430,Shared room,,Amsterdam,,Centrum West,7,5,4,1,,121,,Canal boat RIDE in Amsterdam,2017-07-23 13:06:22.689787,52,5,0101000020E6100000DF180280638F134085EE92382B304A40
4,18630616,1476,70191803,Shared room,,Amsterdam,,De Baarsjes / Oud West,1,0,2,1,,93,,One room for rent in a three room appartment,2017-07-23 13:06:19.681469,52,5,0101000020E6100000CD902A8A57691340187B2FBE682F4A40

In [ ]:
pd.melt(df,)